**Plan Results**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.public_vm_0 must be replaced
-/+ resource "aws_instance" "public_vm_0" {
      ~ ami                                  = "ami-0198740b2d3187f70" -> "ami-015e63d141166c506" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-west-2:523275121194:instance/i-0cc794e2884b53977" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
      ~ id                                   = "i-0cc794e2884b53977" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-037ed42c08224d150" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-250.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.250" -> (known after apply)
+       public_dns                           = (known after apply)
      ~ public_ip                            = "35.90.255.132" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "public_vm_0"
        }
      ~ tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

-       credit_specification {
-           cpu_credits = "standard" -> null
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
-       ebs_block_device {
-           delete_on_termination = false -> null
-           device_name           = "/dev/sdh" -> null
-           encrypted             = true -> null
-           iops                  = 100 -> null
-           kms_key_id            = "arn:aws:kms:us-west-2:523275121194:key/7b12442a-b915-4f9c-8d2b-80421c206f8d" -> null
-           tags                  = {
-               "Name" = "public_vm_ebs_volume_0"
            } -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-08249645a9295eb25" -> null
-           volume_size           = 16 -> null
-           volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
+           kms_key_id            = (known after apply)
-           tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0d4cd51f6323bb18a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_volume_attachment.public_vm_ebs_volume_0_attachment must be replaced
-/+ resource "aws_volume_attachment" "public_vm_ebs_volume_0_attachment" {
      ~ id                             = "vai-1635723233" -> (known after apply)
      ~ instance_id                    = "i-0cc794e2884b53977" -> (known after apply) # forces replacement
+       stop_instance_before_detaching = true
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ public_vm_0_ip = "35.90.255.132" -> (known after apply)
```